{
  "HomePage": {
    "title": "Home Page",
    "about": "About Us",
    "topGames": "Top Games",
    "newGames": "New Games",
    "categories": "Categories",
    "myGames": "My Games",
    "searchGames": "Search Games",
    "viewAll": "View All",
    "favorites": "Favorites",
    "recent": "Recent",
    "noFavorites": "You don't have any favorite games yet",
    "noRecentGames": "You haven't played any games yet",
    "advertisement": "Advertisement",
    "play": "PLAY",
    "download": "Download",
    "downloadon": "Download on {platform}",
    "gameIntro": "Game Introduction",
    "youMightLike": "You might like",
    "notFound": "Not Found",
    "tryOthers": "try others",
    "searchResults": "Search Results",
    "loading": "Loading...",
    "findFavoriteGames": "Find your favorite games",
    "gamesOrganized": "Our games are organized into categories so you can easily find what you're looking for. Check out some of the most popular:",
    "twoPlayerGames": "2 Player Games",
    "oldFrivGames": "Old Friv Games",
    "carGames": "Car Games",
    "shootingGames": "Shooting Games",
    "soccerGames": "Soccer Games",
    "aboutJbuid": "About Jbuid",
    "aboutJbuidDesc1": "Jbuid is a free online gaming platform. Our expert team's goal is to provide the best selection of games on the web and deliver an excellent experience for players.",
    "aboutJbuidDesc2": "Jbuid is accessible directly from your browser and serving players from various countries and languages. Our goal is to provide a fun, functional, and cost-free experience for all users.",
    "catalogDesc": "Our game catalog is carefully curated by our team of experts. With thousands of games for all tastes and ages, around 2 million players choose Jbuid every month to play and have fun.",
    "popularGamesDesc": "Some of the most popular games include hits like",
    "andMore": "and many more. Fans of classic games can enjoy online favorites such as",
    "searchFor": "Search for",
    "searchResultsFormat": "{searchValue} Games",
    "games": "Games"
  },
  "Footer": {
    "topGames": "Top Games",
    "newGames": "New Games",
    "categories": "Categories",
    "aboutUs": "About us",
    "privacyPolicy": "Privacy Policy",
    "contact": "Contact",
    "advertise": "Advertise",
    "copyright": "© 2023 - 2025 {domain}",
    "preferLanguage": "Prefer another language?",
    "playFreeOn": "Play free on"
  },
  "GameDetails": {
    "gameDescription": "Game Description",
    "category": "Category",
    "platform": "Platform",
    "rating": "Rating",
    "relatedGames": "Related Games"
  },
  "Common": {
    "loading": "Loading...",
    "error": "An error occurred",
    "retry": "Retry",
    "home": "Home",
    "category": "Category",
    "hotGame": "Hot Game",
    "darkMode": "Dark Mode",
    "thisWeekPopular": "This Week Popular",
    "searchHistory": "Search History",
    "clearAll": "Clear All",
    "noSearchHistory": "No search history",
    "viewMore": "View more",
    "seeAll": "See all",
    "cancel": "Cancel",
    "confirm": "Confirm",
    "save": "Save",
    "delete": "Delete",
    "edit": "Edit",
    "share": "Share",
    "report": "Report",
    "back": "Back",
    "next": "Next",
    "previous": "Previous",
    "more": "More",
    "less": "Less",
    "close": "Close"
  },
  "MobileMenu": {
    "darkMode": "Dark Mode",
    "lightMode": "Light Mode"
  },
  "Search": {
    "recentSearches": "Recent Searches",
    "popularSearches": "Popular Searches",
    "noResults": "No results found",
    "tryDifferentKeywords": "Try different keywords",
    "searchResults": "Search Results for",
    "searching": "Searching...",
    "clearSearch": "Clear Search"
  },
  "Categories": {
    "action": "Action",
    "puzzle": "Puzzle",
    "sports": "Sports",
    "racing": "Racing",
    "strategy": "Strategy",
    "shooting": "Shooting",
    "casual": "Casual",
    "match3": "Match-3",
    "adventure": "Adventure",
    "arcade": "Arcade",
    "girl": "Girl",
    "recentlyplayed": "Recently Played"
  },
  "CategoriesDesc": {
    "action": "Play the best free action games! On PC or mobile, experience thrilling combat and adventure. Fast-paced gameplay will get your heart racing—dive into the action now!",
    "puzzle": "Challenge free puzzle games! On PC or mobile, solve puzzles, complete patterns, and sharpen your logic. No downloads needed—enjoy brain-teasing fun anytime!",
    "sports": "Play free sports games! On PC or mobile, kick soccer, play basketball, and challenge friends and global players. Multiple sports to choose from—experience the thrill of competition now!",
    "racing": "Drive the best free racing games! On PC or mobile, drift, race, and challenge friends and players worldwide. Realistic racing experience—feel the speed now!",
    "strategy": "Plan your victory! On PC or mobile, play free strategy games, manage resources, command armies, and craft tactics. No downloads needed—start your strategic journey now!",
    "shooting": "Play thrilling free shooting games! On PC or mobile, engage in intense combat and multiplayer battles. Fast-paced action—jump into action-packed battles now!",
    "casual": "Relax with free casual games! On PC or mobile, enjoy simple puzzles, coloring, and relaxing mini-games. Perfect for all players—no downloads needed, unwind now!",
    "match3": "Play free match-3 games! On PC or mobile, swap tiles to complete matches and enjoy the fun of elimination. Easy to play—no downloads, challenge your high score now!",
    "adventure": "Explore free adventure games! On PC or mobile, dive into fantasy worlds, solve puzzles, and embark on exciting journeys with friends. Immersive storytelling—start your adventure now!",
    "arcade": "Play classic arcade games for free! On PC or mobile, enjoy retro-style fast-paced challenges, beat high scores, and compete with friends. No installation needed—start playing instantly!",
    "girl": "Discover free games designed for girls! On PC or mobile, enjoy fashion, decoration, and simulation games. No downloads needed—start your exclusive fun now!"
  },
  "NotFound": {
    "title": "404 Not Found",
    "description": "Sorry, the page you are looking for does not exist or has been removed.",
    "backHome": "back to home"
  },
  "About": {
    "title": "About Us",
    "welcome": "Welcome to {domain}! Here, you’ll find a wide range of fun and casual H5 games you can enjoy anytime.",
    "description": "{domain} is a simple and entertaining HTML5 game platform made for students, office workers, and anyone looking to kill time. No login, no ads, completely free.",
    "joinUs": "Love what we do? Join us! We’re always open to new ideas and collaborations here at {domain}.",
    "aboutUs": "About Us",
    "aboutUsContent": "{domain} was created by a small indie team with a passion for fun and accessibility. Whether you’re on your commute, taking a break, or just chilling at home, we make it easy to jump into a quick game anytime, anywhere.",
    "ourTeam": "Our Team",
    "teamMember1": "🎮 Developer A: A fan of HTML5 gaming, focused on responsive and smooth experiences.",
    "teamMember2": "🎨 Designer B: Dedicated to clean, friendly visuals and comfortable UI design.",
    "parentInfo": "Note to Parents",
    "parentInfoContent": "While all games on {domain} are suitable for general audiences, we recommend that parents supervise usage and manage screen time for younger players.",
    "privacy": "Privacy Policy",
    "privacyContent": "At {domain}, your privacy matters. We collect only limited and necessary data to provide a smooth gaming experience. Learn more on our dedicated Privacy Policy page.",
    "registration": "Registration",
    "registrationContent": "No account or login is required to use {domain}. We don’t store personal data and we don’t track you.",
    "intellectualProperty": "Intellectual Property",
    "intellectualPropertyContent": "All games and media on {domain} belong to their respective creators or licensors. We legally embed or link to all content displayed.",
    "funding": "Funding",
    "fundingContent": "{domain} is funded through ads and community support. All features are free to use, and we strive to maintain a minimal and non-intrusive experience."
  },
  "Privacy": {
    "title": "Privacy Policy",
    "intro": "At {domain}, we respect your privacy and are committed to protecting your personal information. This Privacy Policy outlines how we collect, use, and safeguard your data.",
    "infoCollection": "1. Information Collection: We may collect personal information such as your name and email address when you voluntarily provide it. We also collect non-personal data like your IP address, browsing behavior, and inputs to help improve our services.",
    "infoUse": "2. Use of Information: The information we collect is used to provide and improve our services, respond to inquiries, and send updates or promotional content.",
    "infoSharing": "3. Sharing of Information: We do not sell, trade, or transfer your personal information to third parties unless required by law.",
    "cookies": "4. Cookies: We use cookies to enhance your experience on our website. You can disable cookies via your browser settings, but this may limit some functionality.",
    "security": "5. Security: We implement appropriate security measures to protect your personal data. However, please note that no method of transmission over the internet is 100% secure.",
    "additionalInfo": "At {domain}, we value your privacy highly. We collect browser information including your IP address, referrer, and visited pages. The only other personal data we collect is what you submit in our online forms. {domain} is the sole owner of this information, which is used only for statistical traffic analysis.",
    "cookiesAndTech": "{domain} uses cookies and other technologies to improve your online experience and understand how our services are used to enhance quality.",
    "thirdPartyAds": "We use third-party advertising companies to serve ads when you visit our site. These companies may collect non-personal data about your visits to this and other sites to display ads related to your interests.",
    "googleAds": "Google Ads: As a third-party vendor, Google uses cookies to serve ads on our site. The DART cookie allows Google to serve ads based on your visits to our site and others on the Internet. You can opt out of DART cookie use by visiting Google’s ad and content network privacy policy.",
    "policyUpdates": "This policy may be updated without prior notice, so please check it periodically for changes."
  }
}